src/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<Comment>Штрихкоды объектов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОсновнойШтрихкод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Запрет</Name>
					<Comment>Действия с этим объектом запрещены</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Короб</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕРПЗначениеСчетчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Comment>Штрихкод</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект, которому принадлежит штрихкод (номенклатура, карточка, документ)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:CatalogRef.ПрочиеАктивы</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:CatalogRef.Карточки</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Единица измерения, для которой установлен штрихкод</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры, для которой установлен штрихкод</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ЗапрещенныеШтрихКоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЗапрещенныеШтрихКоды</Name>
			<Comment>Список запрещенных штрих кодов (можно задавать по маске)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЭтоПрефикс</Name>
					<Comment>Истина - это префикс штрих кода, Ложь - это штрихкод</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ШтрихКод</Name>
					<Comment>Штрихкод (или префикс). Префикс задается тем, что после цифр указывается символ *</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИспользованиеШтрихкодированияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ИспользованиеШтрихкодированияДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Использование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокументов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ХарактеристикиНоменклатуры</Name>
			<Comment>Дополнительные характеристики номенклатуры</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.ТипыНоменклатуры</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаИзготовления</Name>
					<Comment>Дата изготовления серии номенклатуры</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокГодности</Name>
					<Comment>Срок годности</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Comment>Серийный номер номенклатуры</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сертификат</Name>
					<Comment>Сертификат номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодтверждающиеДокументы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Качество</Name>
					<Comment>Категория качества номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сортировка</Name>
					<Comment>Порядковый номер характеристики, по которому производиться сортировка элементов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Крепость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержаниеСахара</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Негоциант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Comment>Полный текст строкового дополнительного реквизита</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Справки2ЕГАИС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Справка2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/ШтрихкодированиеВызовСервера/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ 

// Функция Округляет число до ближайшего верхнего целого
//
// Параметры:
//  Значение - число - значение для округления.
//
// Возвращаемое значение:
//  ВремЗначение - число - результат округления.
//
Функция ОкрВверх(Значение)
	ВремЗначение = Цел(Значение);
	Если Значение > ВремЗначение Тогда
		Возврат ВремЗначение + 1;
	Иначе
		Возврат ВремЗначение;
	КонецЕсли;
КонецФункции // ОкрВверх()

// Функция, приводящая строку к необходимой длине строки символом
//
// Параметры:
//  Реж    - число -  1 - добавлять символы слева, 2 - справа, 3 - слева и справа
//  Стр    - строка - строка которую редактируем,
//  Символ - строка - символ, который вставляем,
//  Длина  - Число - длина до которой приводим.
//
// Возвращаемое значение:
//  Стр - строка - результат редактирования строки.
//
Функция СтрокаПривести(Стр,Символ,Длина,Реж=1)
	ДопСтр=""; Сч=Длина-СтрДлина(Стр);
	Если Сч>0  Тогда
		Для к=1 По Сч Цикл
			ДопСтр=ДопСтр+Символ;
		КонецЦикла;
		Если Реж=1 Тогда Возврат ДопСтр+Стр;
		ИначеЕсли Реж=2 Тогда Возврат Стр+ДопСтр;
		Иначе к=Окр(Сч/2); Возврат Лев(ДопСтр,к)+Стр+Прав(ДопСтр,Сч-к);
		КонецЕсли;
	Иначе Возврат Стр;
	КонецЕсли;
КонецФункции // СтрокаПривести()

// Функция Возвращает псевдослучайное число указанного порядка
// (порядок равен количеству цифр в числе, [1..10])
// Используется генератор GUID.
//
// Параметры:
//  Порядок - порядок числа
//
// Возвращаемое значение:
//  получено число
//
Функция СлучайноеЧисло(Порядок)
	
	Мин = 0;   //минимальное допустимое значение произвольного кода
	Макс = 1;  //максимальное допустимое значение произвольного кода
	Для х = 0 По Порядок - 1 Цикл 
		Макс = Макс * 10; 
	КонецЦикла;
	Макс = Макс-1;
	
	// генерируем GUID и оставляем только цифры
	НовыйУИ = СокрЛП(Новый УникальныйИдентификатор);
	НовыйУИ = СтрЗаменить(НовыйУИ,"-","");
	НовыйУИ = СтрЗаменить(НовыйУИ,"a","");
	НовыйУИ = СтрЗаменить(НовыйУИ,"b","");
	НовыйУИ = СтрЗаменить(НовыйУИ,"c","");
	НовыйУИ = СтрЗаменить(НовыйУИ,"d","");
	НовыйУИ = СтрЗаменить(НовыйУИ,"e","");
	НовыйУИ = СтрЗаменить(НовыйУИ,"f","");
	
	// знаменатель должен иметь такое же количество нулей + 1
	Знаменатель = 10;
	Для н = 2 По (СтрДлина(СтрЗаменить(НовыйУИ,Символы.НПП,""))) Цикл
		Знаменатель = Знаменатель * 10;
	КонецЦикла; 
	
	// получим дробное случайное число в диапазоне от 0 до 1
	Случ = Число(НовыйУИ) / Знаменатель;     
	
	// Преобразуем его в случайное число из заданного интервала, округляем до целого.
	ЧислоИзИнтервала = Мин(Макс(Окр(Мин + (Макс-Мин)*Случ),Мин),Макс);
	Возврат ЧислоИзИнтервала;
	
КонецФункции // СлучайноеЧисло()

// Вычисляет контрольную цифру EAN-13/EAN-8 
// Возвращает штрих-код с контрольной цифрой.
//
// Параметры:
//  Код - строка - код, по которому вычисляем контрольную цифру.
//
// Возвращаемое значение:
//  Рез - Строка - штрих-код с контрольной цифрой. 
//
Функция EAN13(Код) Экспорт
	ШтрКод = Формат(Число(Код),"ЧН=; ЧВН=; ЧГ=0; ЧЦ="+?(СтрДлина(Код)<8,"7","12"));
	Четн = 0; Нечетн = 0;
	Если СтрДлина(Код)=7 Тогда
		Итераций = 4; 
	Иначе
		Итераций = 6; 
	КонецЕсли;
	Для Индекс=1 По Итераций Цикл
		Четн=Четн+Сред(ШтрКод,2*Индекс,1);
		Если НЕ (Итераций=4 И Индекс=Итераций) Тогда
			Четн=Четн+Сред(ШтрКод,2*Индекс,1);
		КонецЕсли;
		Нечетн=Нечетн+Сред(ШтрКод,2*Индекс-1,1);
	КонецЦикла;
	Если СтрДлина(Код)=7 Тогда Нечетн=Нечетн*3; 
	Иначе Четн=Четн*3;
	КонецЕсли;
	КонтЦифра=10-(Четн+Нечетн)%10;
	Если КонтЦифра=10 Тогда КонтЦифра=0; КонецЕсли;
	Рез=ШтрКод+Строка(КонтЦифра);
	Возврат Рез;
КонецФункции // EAN13()

// Формирует случайный код в произвольном алфавитно-цифровом формате
// Используется генератор GUID
// Возвращает строку чисел если АлфавитноЦифровой=0 и буквенно-цифровую A-Z&0-9 иначе.
//
// Параметры:
//  КоличествоЗнаков - число - длина кода,
//  АлфавитноЦифровой - число определяет тип кода.
//
// Возвращаемое значение:
//  Стр - строка - сформированный произвольный код.
//
Функция СформироватьПроизвольныйКод(КоличествоЗнаков = 22)

	Стр = "";
	Для К = 1 По ОкрВверх(КоличествоЗнаков / 10) Цикл
		Стр = Стр + Формат(СлучайноеЧисло(10),"ЧЦ=10; ЧН=; ЧВН=; ЧГ=0");
	КонецЦикла;
	Возврат Лев(Стр, КоличествоЗнаков);
	
КонецФункции // СформироватьПроизвольныйКод()

// Эта процедура работает по алгоритмам, принятым в магазинах Семья г. Пермь
// Надо типизировать, а у Семьи вынести в расширение конфигурации
Функция ЭтоШтрихкодУценки(Штрихкод,Номенклатура) Экспорт
	ЭтоВесовойТовар = Номенклатура.ТипНоменклатуры.Весовой;
	Если ЭтоВесовойТовар Тогда
		Если СтрДлина(Штрихкод)<>7 Тогда
			Возврат Ложь;
		КонецЕсли;
		ПрефиксШК3 = Лев(Штрихкод,3);
		Если ПрефиксШК3="239" Тогда
			// надо проверить есть ли у товара другие ш/к уценки
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	Штрихкоды.Штрихкод КАК Штрихкод
			                      |ИЗ
			                      |	РегистрСведений.Штрихкоды КАК Штрихкоды
			                      |ГДЕ
			                      |	Штрихкоды.Объект = &Объект");
			Запрос.УстановитьПараметр("Объект",Номенклатура);
			Выборка = Запрос.Выполнить().Выбрать();
			// если есть другие уценочные, то 239 не является уценкой
			Пока Выборка.Следующий() Цикл
				Если СтрДлина(Выборка.Штрихкод)<>7 Тогда
					Продолжить;
				КонецЕсли;
				тмпПрефиксШК3 = Лев(Выборка.Штрихкод,3);
				Если тмпПрефиксШК3="229" ИЛИ тмпПрефиксШК3="249" ИЛИ тмпПрефиксШК3="259" ИЛИ тмпПрефиксШК3="269" ИЛИ тмпПрефиксШК3="289" ИЛИ тмпПрефиксШК3="299" Тогда
					Возврат Ложь;
				КонецЕсли;
			КонецЦикла;
			Возврат Истина;
		Иначе
			Возврат ПрефиксШК3="229" ИЛИ ПрефиксШК3="249" ИЛИ ПрефиксШК3="259" ИЛИ ПрефиксШК3="269" ИЛИ ПрефиксШК3="289" ИЛИ ПрефиксШК3="299";
		КонецЕсли;
	Иначе
		УценочныйШК = "9"+СокрЛП(Номенклатура.Артикул);
		Возврат Штрихкод=УценочныйШК;
	КонецЕсли;
КонецФункции

Функция ПолучитьШтрихкодУценки(Номенклатура,ЭтоУценочныеШтрихкоды=Истина) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Штрихкоды.Штрихкод КАК Штрихкод
	                      |ИЗ
	                      |	РегистрСведений.Штрихкоды КАК Штрихкоды
	                      |ГДЕ
	                      |	Штрихкоды.Объект = &Объект");
	Запрос.УстановитьПараметр("Объект",Номенклатура);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЭтоУценочныеШтрихкоды Тогда
			Если ЭтоШтрихкодУценки(Выборка.Штрихкод,Номенклатура) Тогда
				Возврат Выборка.Штрихкод;
			КонецЕсли;
		Иначе
			Если НЕ ЭтоШтрихкодУценки(Выборка.Штрихкод,Номенклатура) Тогда
				Возврат Выборка.Штрихкод;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат "";
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ШТРИХКОДА 

// Формирует штрихкод в формате EAN-13
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Штрихкод
Функция СформироватьШтрихкодEAN13(Товар = Неопределено, ЕстьПрефикс = Ложь, Весовой = Ложь)
	
	ДлинаКода = 12; //13й символ - проверочный
	ПрефиксКода = "";
	
	Если ЕстьПрефикс Тогда
		
		Если Весовой Тогда
		   
			ДлинаКода = 5; //Для весового товара длина штрихкода 7 символов, в том числе 2 символа префикса
			ПрефиксКода = Строка(Константы.ПрефиксВесовогоШК.Получить());
			
		Иначе
			
			ДлинаКода = 10;	//Для не весового товара длина штрихкода 12 символов, в том числе 2 символа префикса
			ПрефиксКода = Строка(Константы.ПрефиксШтучногоШК.Получить());
			
		КонецЕсли;
		
	КонецЕсли;	
		
	НовыйКод = EAN13(Строка(ПрефиксКода) + СтрокаПривести(СформироватьПроизвольныйКод(ДлинаКода), "0", 12 - СтрДлина(ПрефиксКода), 2));
	Пока НЕ ПроверкаНовогоШтрихкода(НовыйКод, ЕстьПрефикс) Цикл
		НовыйКод = EAN13(Строка(ПрефиксКода) + СтрокаПривести(СформироватьПроизвольныйКод(ДлинаКода), "0", 12 - СтрДлина(ПрефиксКода), 2));
	КонецЦикла;
	
	Возврат НовыйКод; 
	
КонецФункции // СформироватьШтрихкод()

// Формирует штрихкод произвольной длины для произвольного объекта 
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Штрихкод
Функция СформироватьШтрихкодПроизвольногоОбъекта(Объект, ДлинаКода = 22) Экспорт 
	
	НовыйКод = СформироватьПроизвольныйКод(ДлинаКода);
	Пока НЕ ПроверкаНовогоШтрихкода(НовыйКод) Цикл
		НовыйКод = СформироватьПроизвольныйКод(ДлинаКода);
	КонецЦикла;
	
	Возврат НовыйКод;
	
КонецФункции // СформироватьНовыйШтрихкод()

// Формирует штрихкод объекта
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Штрихкод
Функция СформироватьНовыйШтрихкод(Объект, ДлинаКода = 22) Экспорт
	
	Если ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.Карточки") Тогда
	
		Возврат СформироватьШтрихкодПроизвольногоОбъекта(Объект, ДлинаКода); 
		
	ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.Номенклатура") Тогда
		
		Весовой = ?(ЗначениеЗаполнено(Объект.ТипНоменклатуры),Объект.ТипНоменклатуры.Весовой,Ложь);
		Возврат СформироватьШтрихкодEAN13(Объект, Истина, Весовой); 
		
	ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.ПрочиеАктивы") Тогда

		Возврат СформироватьШтрихкодEAN13(Объект, Ложь); 
		
	ИначеЕсли Метаданные.Документы.Содержит(Объект.Ссылка.Метаданные()) Тогда

		Возврат СформироватьШтрихкодEAN13(Объект, Ложь); 
		
	КонецЕсли;	
	
КонецФункции // СформироватьНовыйШтрихкод()

// Функция проверяет штрихкод на наличие в списке запрещенных штрих кодов
//
// Параметры
//  <Штрихкод>  - Проверяемый штрихкод
// Возвращаемое значение:
//  Истина - если код запрещен
//  Ложь   - если код разрешен.
Функция ШтрихкодЗапрещен(Штрихкод)
	
	НайденныйШтрихкод = "";
	
	// поиск по штрихкоду
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ЗапрещенныеШтрихкоды.ШтрихКод КАК Штрихкод
	                      |ИЗ
	                      |	РегистрСведений.ЗапрещенныеШтрихКоды КАК ЗапрещенныеШтрихкоды
	                      |ГДЕ
	                      |	НЕ ЗапрещенныеШтрихкоды.ЭтоПрефикс
	                      |	И ЗапрещенныеШтрихкоды.ШтрихКод = &Штрихкод
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ 
	                      |	ЗапрещенныеШтрихКоды.ШтрихКод
	                      |ИЗ
	                      |	РегистрСведений.ЗапрещенныеШтрихКоды КАК ЗапрещенныеШтрихКоды
	                      |ГДЕ
	                      |	ЗапрещенныеШтрихКоды.ЭтоПрефикс
	                      |	И &Штрихкод ПОДОБНО ЗапрещенныеШтрихКоды.ШтрихКод + ""%""");
	Запрос.УстановитьПараметр("Штрихкод",Штрихкод);
	Результат=Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		НайденныйШтрихкод = Результат.Выгрузить().Получить(0).Штрихкод;
	КонецЕсли;
	
	Возврат НЕ ПустаяСтрока(НайденныйШтрихкод);
	
КонецФункции // ШтрихкодЗапрещен()

// Функция возвращает штрихкод объекта.
// Объект - объект, штрихкоды которого отбираются.
//
// Параметры:
//  Нет.
//
Функция ПрочитатьШтрихкодДокумента(Форма, Объект) Экспорт
	
	ИспользованиеШтрихкодирования = ИспользоватьШтрихкодирование(Объект);
	Если ИспользованиеШтрихкодирования Тогда
		Штрихкод =  ПолучитьШтрихКодОбъекта(Объект,,,Ложь);
		Если ЕстьРеквизит(Форма,"Штрихкод") Тогда
			Форма.Штрихкод = Штрихкод;				
		Иначе
			СлужебныеРеквизиты = Новый Структура();
			СлужебныеРеквизиты.Вставить("Штрихкод", Штрихкод);
			УправлениеДиалогомСервер.ДобавитьРеквизитыФормы(Форма, СлужебныеРеквизиты);
		КонецЕсли;
	КонецЕсли;
	
КонецФункции // ПолучитьШтрихКодОбъекта()

// Выполняет штрихкодирование документов.
//
// Параметры
//  Объект  - ссылка или объект документа для штрихкодирования.
//
// Возвращаемое значение:
//  Истина - если штрихкодирование выполнено или штрихкодирование не используется для объекта
//  Ложь   - если не удалось записать штрихкод.
Функция ЗаписатьШтрихкодДокумента(Форма, Объект) Экспорт
		
	Если НЕ ИспользоватьШтрихкодирование(Объект) Тогда
		Возврат Истина;
	КонецЕсли;
	
	ШтрихКод = "";
	
	// Выполним запись штрихкода
	Если ЕстьРеквизит(Форма,"Штрихкод") Тогда
		Если ЗначениеЗаполнено(Форма.Штрихкод) Тогда
			Штрихкод = Форма.Штрихкод;
			СтруктураШтрихкод = Новый Структура("Штрихкод,Запрет", ШтрихКод, Ложь);
			
			ШтрихкодЗаписан = Ложь; 
			Если ЕстьРеквизит(Объект, "Ссылка") Тогда
				ШтрихкодЗаписан = ЗаписатьШтрихкоды(Объект.Ссылка, СтруктураШтрихкод);
			КонецЕсли;
			
			Если НЕ ШтрихкодЗаписан Тогда
				ТекстОшибки = НСтр("ru = 'Ошибка записи штрихкода документа.'");
				ВывестиСообщение(ТекстОшибки);
				ВызватьИсключение ТекстОшибки;
			Иначе
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Возможно необходимо присвоить штрихкод автоматически
	Если НЕ ИспользоватьАвтоШтрихкодированиеДокументов(Объект) Тогда
		Возврат Истина;
	КонецЕсли;
	
	// Документ может быть штрихкодирован
	Если ПустаяСтрока(ШтрихКод) Тогда
		
		// Создадим новый штрихкод
		ШтрихКод = СформироватьНовыйШтрихкод(Объект);
		
		// Запишем автоматически сформированный штрихкод
		СтруктураШтрихкод = Новый Структура("Штрихкод,Запрет", ШтрихКод, Ложь);
		ШтрихкодЗаписан = ЗаписатьШтрихкоды(Объект.Ссылка, СтруктураШтрихкод);
		Если НЕ ШтрихкодЗаписан Тогда
			ТекстОшибки = НСтр("ru = 'Ошибка записи штрихкода документа.'") ;
			ВывестиСообщение(ТекстОшибки);
			ВызватьИсключение ТекстОшибки;
		Иначе
			Форма.Штрихкод = Штрихкод;
			ВывестиСообщение(НСтр("ru = 'Документу <'") + Объект.Ссылка + НСтр("ru = '> присвоен штрихкод ""'") + ШтрихКод + НСтр("ru = '""'"));
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Функция возвращает штрихкод объекта.
// Объект - объект, штрихкоды которого отбираются.
//
// Параметры:
//  Нет.
//
Функция ПолучитьШтрихКодОбъекта(Объект, ХарактеристикаНоменклатуры = Неопределено, ЕдиницаИзмерения = Неопределено, ВсеШтрихкоды = Ложь) Экспорт
	
	Запрос = Новый Запрос();
    Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.Текст="ВЫБРАТЬ
	             |	ШтрихКоды.Объект КАК Объект,
	             |	ШтрихКоды.Штрихкод,
	             |	ШтрихКоды.Запрет,
	             |	ШтрихКоды.ЕдиницаИзмерения,
	             |	ШтрихКоды.ХарактеристикаНоменклатуры
	             |ИЗ
	             |	РегистрСведений.Штрихкоды КАК ШтрихКоды
	             |ГДЕ
	             |	ШтрихКоды.Объект = &Ссылка";
	
	Если ТипЗнч(Объект) = Тип("СправочникСсылка.Номенклатура") Тогда 
		Если Объект.ТипНоменклатуры.ИспользованиеШтрихКодов = 2 И ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда
			ЗаменяемыйТекст = "ШтрихКоды.Объект = &Ссылка";
			ТекстЗамены = "ШтрихКоды.Объект = &Ссылка
			|		  И ВЫБОР
			|			КОГДА ШтрихКоды.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
			|				ТОГДА ШтрихКоды.Объект.ОсновнаяЕдиницаИзмерения
			|			ИНАЧЕ ШтрихКоды.ЕдиницаИзмерения
			|			КОНЕЦ = &ЕдиницаИзмерения";
			Запрос.Текст = СтрЗаменить(Запрос.Текст, ЗаменяемыйТекст, ТекстЗамены);
			Запрос.УстановитьПараметр("ЕдиницаИзмерения", ЕдиницаИзмерения);
		КонецЕсли;
		Если Объект.ТипНоменклатуры.ИспользованиеШтрихКодов = 3 И ЗначениеЗаполнено(ХарактеристикаНоменклатуры) Тогда
			ЗаменяемыйТекст = "ШтрихКоды.Объект = &Ссылка";
			ТекстЗамены = "ШтрихКоды.Объект = &Ссылка,
			|         И ШтрихКоды.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры";
			Запрос.Текст = СтрЗаменить(Запрос.Текст, ЗаменяемыйТекст, ТекстЗамены);
			Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", ХарактеристикаНоменклатуры);
		КонецЕсли;
	КонецЕсли;
		РезультатЗапроса = Запрос.Выполнить();
	
	Если ВсеШтрихкоды Тогда
		Возврат РезультатЗапроса.Выгрузить();
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Штрихкод;
		Иначе
			Возврат "";
		КонецЕсли
	КонецЕсли;
	
КонецФункции // ПолучитьШтрихКодОбъекта()

// Функция возвращает штрихкод объекта.
// Объект - объект, штрихкоды которого отбираются.
//
// Параметры:
//  Нет.
//
Процедура ЗаполнитьШтрихКодыТоваров(Товары) Экспорт
	
	Номенклатура   = Новый Массив();
	Характеристики = Новый Массив();
	ЕдиницыИзмерения = Новый Массив();
	
	Характеристики  .Добавить(Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	ЕдиницыИзмерения.Добавить(Справочники.ЕдиницыИзмерения.ПустаяСсылка());
	
	Для каждого СтрокаТаблицыТоваров Из Товары Цикл
		Если ЗначениеЗаполнено(СтрокаТаблицыТоваров.Номенклатура) И ТипЗнч(СтрокаТаблицыТоваров.Номенклатура)=Тип("СправочникСсылка.Номенклатура") Тогда
			Номенклатура.Добавить(СтрокаТаблицыТоваров.Номенклатура);
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаТаблицыТоваров.ЕдиницаИзмерения) Тогда
			ЕдиницыИзмерения.Добавить(СтрокаТаблицыТоваров.ЕдиницаИзмерения);
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаТаблицыТоваров.ХарактеристикаНоменклатуры) Тогда
			Характеристики.Добавить(СтрокаТаблицыТоваров.ХарактеристикаНоменклатуры);
		КонецЕсли;
	КонецЦикла;
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ШтрихКоды.Штрихкод,
	|	ШтрихКоды.Объект.ТипНоменклатуры.ИспользованиеШтрихКодов КАК ИспользованиеШтрихКодов,
	|	ШтрихКоды.Объект КАК Номенклатура,
	|	ШтрихКоды.Запрет,
	|	ШтрихКоды.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ШтрихКоды.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК ШтрихКоды
	|ГДЕ
	|	ШтрихКоды.Объект В(&Номенклатура)
	|	И ШтрихКоды.ЕдиницаИзмерения В(&ЕдиницыИзмерения)
	|	И ШтрихКоды.ХарактеристикаНоменклатуры В(&Характеристики)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЕдиницаИзмерения УБЫВ,
	|	ХарактеристикаНоменклатуры УБЫВ";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Номенклатура",     Номенклатура);
	Запрос.УстановитьПараметр("Характеристики",   Характеристики);
	Запрос.УстановитьПараметр("ЕдиницыИзмерения", ЕдиницыИзмерения);
	
	Штрихкоды = Запрос.Выполнить().Выгрузить();
	
	КоличествоСтрок = Товары.Количество()-1;
	Пока КоличествоСтрок>=0 Цикл
		
		СтрокаТаблицыТоваров = Товары[КоличествоСтрок];
		
		ПараметрыНоменклатуры = Штрихкоды.Найти(СтрокаТаблицыТоваров.Номенклатура, "Номенклатура");
		
		Если ПараметрыНоменклатуры=Неопределено Тогда
			КоличествоСтрок = КоличествоСтрок - 1;
			Продолжить;
		КонецЕсли;
		
		ПараметрыОтбора = Новый Структура("Номенклатура", СтрокаТаблицыТоваров.Номенклатура);
		
		Если ПараметрыНоменклатуры.ИспользованиеШтрихКодов=2 И ЗначениеЗаполнено(СтрокаТаблицыТоваров.ЕдиницаИзмерения) Тогда
			ПараметрыОтбора.Вставить("ЕдиницаИзмерения", СтрокаТаблицыТоваров.ЕдиницаИзмерения);
		КонецЕсли;
		Если ПараметрыНоменклатуры.ИспользованиеШтрихКодов=3 И ЗначениеЗаполнено(СтрокаТаблицыТоваров.ХарактеристикаНоменклатуры) Тогда
			ПараметрыОтбора.Вставить("ХарактеристикаНоменклатуры", СтрокаТаблицыТоваров.ХарактеристикаНоменклатуры);
		КонецЕсли;
		
		НайденныеСтроки = Штрихкоды.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() > 0 Тогда
			СтрокаТаблицыТоваров.Штрихкод = НайденныеСтроки[0].Штрихкод;
		КонецЕсли;
		
		Если НайденныеСтроки.Количество() > 1 Тогда
			Для Позиция = 1 По НайденныеСтроки.ВГраница() Цикл
				НоваяСтрока = Новый Структура;
				Для Каждого ТекущаяКолонка Из СтрокаТаблицыТоваров Цикл
					НоваяСтрока.Вставить(ТекущаяКолонка.Ключ, ТекущаяКолонка.Значение);
				КонецЦикла;
				НоваяСтрока.Штрихкод = НайденныеСтроки[Позиция].Штрихкод;
				Товары.Добавить(НоваяСтрока);
			КонецЦикла;
		КонецЕсли;
		
		КоличествоСтрок = КоличествоСтрок - 1;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьШтрихКодыТоваров()

// Функция записывает штрихкод (массив штрихкодов) в информационную базу.
//
// Параметры:
//  Объект - объект, для которого записываются штрихкоды.
//
// Возвращаемое значение:
//  Истина - если штрихкоды были записаны или их не требуется записывать
//  Ложь   - если штрихкоды не удалось записать.
Функция ЗаписатьШтрихКоды(Ссылка, МассивШтрихкоды) Экспорт

	Если НЕ ИспользоватьШтрихкодирование(Ссылка) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ТипЗнч(Ссылка)=Тип("СправочникСсылка.Номенклатура") Тогда
		РежимШтрихкодированияНоменклатуры = РежимШтрихкодированияНоменклатуры(Ссылка);
	КонецЕсли;
	
	Если ТипЗнч(МассивШтрихкоды) <> Тип("Массив")
		И ТипЗнч(МассивШтрихкоды) = Тип("Структура") Тогда
		СтруктураШтрихкод = МассивШтрихкоды;
		МассивШтрихкоды = Новый Массив;
		МассивШтрихкоды.Добавить(СтруктураШтрихкод);
	КонецЕсли;
	
	НаборЗаписейШтрихКоды = РегистрыСведений.ШтрихКоды.СоздатьНаборЗаписей();
	НаборЗаписейШтрихКоды.Отбор.Объект.Установить(Ссылка);
	
	Для Каждого СтруктураШтрихКод Из МассивШтрихкоды Цикл
	
		Если НЕ ЗначениеЗаполнено(СтруктураШтрихКод.Штрихкод) Тогда 
			Продолжить; 
		КонецЕсли;
		
		Запись = НаборЗаписейШтрихКоды.Добавить();
		Запись.Объект = Ссылка;
		Запись.ШтрихКод = СтруктураШтрихКод.ШтрихКод;
		Запись.Запрет = СтруктураШтрихКод.Запрет;
		
		Если РежимШтрихкодированияНоменклатуры <> Неопределено Тогда
			Если РежимШтрихкодированияНоменклатуры = 2 Тогда
				Запись.ЕдиницаИзмерения = СтруктураШтрихКод.ЕдиницаИзмерения;
			ИначеЕсли РежимШтрихкодированияНоменклатуры = 3 Тогда
				Запись.ХарактеристикаНоменклатуры = СтруктураШтрихКод.ХарактеристикаНоменклатуры;
			КонецЕсли; 
		КонецЕсли; 
	
	КонецЦикла;
	
	Попытка
		НаборЗаписейШтрихкоды.Записать();
	Исключение
		ВывестиСообщение(НСтр("ru = 'Не удалось записать штрихкоды:'") + Символы.ПС + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;

	Возврат Истина;
		
КонецФункции // ЗаписатьШтрихКоды()

// Проверяет, ведется ли штрихкодирования по данному виду объектов.
//
// Параметры:
//  Объект - ссылка или объект для проверки.
//
// Возвращаемое значение:
//  Истина - штрихкодирование ведется
//  Ложь   - штрихкодирование не ведется.
Функция ИспользоватьШтрихкодирование(Объект) Экспорт
	
	// Проверка, входит ли тип ссылки в тип данных объекта в регистре сведений.
	Результат = Метаданные.РегистрыСведений.ШтрихКоды.Измерения.Объект.Тип.СодержитТип(ТипЗнч(Объект.Ссылка));
	Если НЕ Результат Тогда
		Возврат Ложь
	КонецЕсли;
	
	Если Метаданные.Документы.Содержит(Объект.Ссылка.Метаданные()) Тогда
		
		// для документов
		Возврат Истина;
		
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникОбъект.Номенклатура") ИЛИ ТипЗнч(Объект) = Тип("СправочникСсылка.Номенклатура") Тогда
		
		// для номенклатуры
		ТипНоменклатуры = Объект.ТипНоменклатуры;
		Если ЗначениеЗаполнено(ТипНоменклатуры) Тогда
			Если ТипНоменклатуры.ИспользованиеШтрихКодов = 0 Тогда
				Возврат Ложь;
			Иначе
				Возврат Истина;
			КонецЕсли;
		Иначе
			Возврат Ложь;
		КонецЕсли;
		
	Иначе	
		
		// для прочих справочников
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции // ИспользоватьШтрихкодирование()

// Проверяет, ведется ли автоматическое штрихкодирование по данному виду объектов.
//
// Параметры:
//  Объект - ссылка или объект для проверки.
//
// Возвращаемое значение:
//  Истина - штрихкодирование ведется
//  Ложь   - штрихкодирование не ведется.
Функция ИспользоватьАвтоШтрихкодированиеДокументов(Объект)
	
	Если НЕ ЗначениеЗаполнено(Объект.ПодразделениеКомпании) Тогда
		Возврат Ложь;
	КонецЕсли;
		
	Если НЕ Объект.ПодразделениеКомпании.АвтоматическоеШтрихкодированиеДокументов Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИспользованиеШтрихкодированияДокументов.ПодразделениеКомпании,
	               |	ИспользованиеШтрихкодированияДокументов.ВидДокументов,
	               |	ИспользованиеШтрихкодированияДокументов.Использование
	               |ИЗ
	               |	РегистрСведений.ИспользованиеШтрихкодированияДокументов КАК ИспользованиеШтрихкодированияДокументов
	               |ГДЕ
	               |	ИспользованиеШтрихкодированияДокументов.ПодразделениеКомпании = &ПодразделениеКомпании
	               |	И ИспользованиеШтрихкодированияДокументов.ВидДокументов = &ВидДокументов";
	Запрос.УстановитьПараметр("ВидДокументов",Объект.Ссылка.Метаданные().Имя);
	Запрос.УстановитьПараметр("ПодразделениеКомпании",Объект.ПодразделениеКомпании);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Использование;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции // ИспользоватьШтрихкодирование()

// Возвращает режим штрихкодирования номенклатуры
//
// Параметры:
//  Объект - ссылка или объект для проверки.
//
// Возвращаемое значение:
//  Режим штрихкодирования номенклатуры.
Функция РежимШтрихкодированияНоменклатуры(Объект)
	
	ТипНоменклатуры = Объект.ТипНоменклатуры;
	Если ЗначениеЗаполнено(ТипНоменклатуры) Тогда
		Возврат ТипНоменклатуры.ИспользованиеШтрихКодов;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции // РежимШтрихкодированияНоменклатуры()

// Выполняет поиск объектов по штрихкоду.
//
// Параметры:
//  ШтрихКод - штрихкод, по которому ведется поиск
//  ЕстьПрефикс - признак, что штрихкод содержит префикс
//  ДополнительноеУсловие - дополнительное условие поиска по виду объекта.
//
// Возвращаемое значение:
//  Ссылка на найденный справочник или документ.
//
Функция НайтиОбъектыПоШтрихкоду(ШтрихкодПараметр, ЕстьПрефикс = Истина, ПроверкаЗапрета = Ложь, Вес = 0) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// формирование массива штрихкодов на основе переданных параметров
	МассивШтрихкоды = Новый Массив;
	Если ТипЗнч(ШтрихкодПараметр) = Тип("Массив") Тогда
		МассивШтрихкоды = ШтрихкодПараметр;
	Иначе
		МассивШтрихкоды.Добавить(ШтрихкодПараметр);
	КонецЕсли;
	
	Вес = 0;
	
	// поиск объектов по штрихкоду
	Если ЕстьПрефикс Тогда
		
		ПрефиксВесовогоШК = Константы.ПрефиксВесовогоШК.Получить();
		
		ТаблицаШтрихкоды = Новый ТаблицаЗначений;
		ТаблицаШтрихкоды.Колонки.Добавить("Штрихкод",Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(200)));
		ТаблицаШтрихкоды.Колонки.Добавить("Префикс",Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(200)));
		
		// для весовых товаров уникальность проверяется по первым 7 символам
		Для Каждого Штрихкод Из МассивШтрихкоды Цикл
			НоваяСтрока = ТаблицаШтрихкоды.Добавить();
			НоваяСтрока.Штрихкод = Штрихкод;                                       
			Если Лев(Штрихкод,2) = Строка(ПрефиксВесовогоШК) Тогда
				НоваяСтрока.Префикс = Формат(Лев(Штрихкод,7),"ЧГ=0");
				
				// Вытащим вес
				Вес = Сред(Штрихкод, 8, СтрДлина(Штрихкод)-8);
				Если ЗначениеЗаполнено(Вес) Тогда
					Вес = Число(Вес)/1000;
				Иначе
					Вес = 0;
				КонецЕсли;
				
			Иначе
				НоваяСтрока.Префикс = Штрихкод;
			КонецЕсли; 
		КонецЦикла;
		
		Запрос = Новый Запрос();
	    Запрос.УстановитьПараметр("ТаблицаШтрихкоды", ТаблицаШтрихкоды);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТаблицаШтрихкоды.Штрихкод,
		               |	ТаблицаШтрихкоды.Префикс
		               |ПОМЕСТИТЬ ТаблицаШтрихкодыВТ
		               |ИЗ
		               |	&ТаблицаШтрихкоды КАК ТаблицаШтрихкоды
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ТаблицаШтрихкодыВТ.Штрихкод КАК Штрихкод,
		               |	ТаблицаШтрихкодыВТ.Префикс КАК Префикс,
		               |	ШтрихКоды.Штрихкод КАК ШтрихкодОбъекта,
		               |	ШтрихКоды.Объект,
		               |	ШтрихКоды.ЕдиницаИзмерения,
		               |	ШтрихКоды.ХарактеристикаНоменклатуры,
		               |	ШтрихКоды.Запрет КАК Запрет
		               |ИЗ
		               |	ТаблицаШтрихкодыВТ КАК ТаблицаШтрихкодыВТ
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК ШтрихКоды
		               |		ПО (ШтрихКоды.Штрихкод ПОДОБНО ТаблицаШтрихкодыВТ.Префикс + ""%"")
		               |ГДЕ
		               |	ШтрихКоды.Объект ЕСТЬ НЕ NULL ";
		НайденныеОбъекты = Запрос.Выполнить().Выгрузить();
		
		Если НайденныеОбъекты.Количество() = 0 Тогда
			Запрос = Новый Запрос();
			Запрос.Текст = "ВЫБРАТЬ
			|	ТаблицаШтрихкоды.Штрихкод,
			|	ТаблицаШтрихкоды.Префикс
			|ПОМЕСТИТЬ ТаблицаШтрихкодыВТ
			|ИЗ
			|	&ТаблицаШтрихкоды КАК ТаблицаШтрихкоды
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ТаблицаШтрихкодыВТ.Штрихкод КАК Штрихкод,
			|	ТаблицаШтрихкодыВТ.Префикс КАК Префикс,
			|	ШтрихКоды.Штрихкод КАК ШтрихкодОбъекта,
			|	ШтрихКоды.Объект,
			|	ШтрихКоды.ЕдиницаИзмерения,
			|	ШтрихКоды.ХарактеристикаНоменклатуры,
			|	ШтрихКоды.Запрет КАК Запрет
			|ИЗ
			|	ТаблицаШтрихкодыВТ КАК ТаблицаШтрихкодыВТ
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК ШтрихКоды
			|		ПО (ШтрихКоды.Штрихкод ПОДОБНО ТаблицаШтрихкодыВТ.Префикс + ""%"")
			|ГДЕ
			|	ШтрихКоды.Объект ЕСТЬ НЕ NULL ";
			ТаблицаШтрихкоды.Очистить();
			Для Каждого Штрихкод Из МассивШтрихкоды Цикл
				НоваяСтрока = ТаблицаШтрихкоды.Добавить();
				НоваяСтрока.Штрихкод = Штрихкод;                                       
				НоваяСтрока.Префикс = ЛЕВ(Штрихкод,7);
			КонецЦикла;
			
			Запрос.УстановитьПараметр("ТаблицаШтрихкоды", ТаблицаШтрихкоды);
			НайденныеОбъекты = Запрос.Выполнить().Выгрузить();
		КонецЕсли;	
		
	Иначе
		
		Запрос = Новый Запрос();
	    Запрос.УстановитьПараметр("МассивШтрихкоды", МассивШтрихкоды);
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ШтрихКоды.Штрихкод КАК Префикс,
		               |	ШтрихКоды.Объект,
					   |	ШтрихКоды.ЕдиницаИзмерения,
		               |	ШтрихКоды.Штрихкод,
		               |	ШтрихКоды.Запрет
		               |ИЗ
		               |	РегистрСведений.Штрихкоды КАК ШтрихКоды
		               |ГДЕ
		               |	ШтрихКоды.Штрихкод В(&МассивШтрихкоды)";
		НайденныеОбъекты = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);

	Возврат НайденныеОбъекты;
	
КонецФункции // НайтиОбъектыПоШтрихкоду()

// Выполняет поиск карточки по штрихкоду и возвращает ссылку на найденную карточку либо Неопределено.
//
// Параметры:
//  Штрихкод - Штрихкод для поиска
// Возвращаемое значение:
//   - 
Функция ПолучитьКарточкуПоКоду(Штрихкод) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ШтрихКоды.Объект КАК Карточка
	|ИЗ
	|	РегистрСведений.ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	ШтрихКоды.ШтрихКод = &Штрихкод
	|	И ШтрихКоды.Объект ССЫЛКА Справочник.Карточки";
	
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Карточка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции // ПолучитьКарточкуПоКоду()

// Формирует сообщение о неуникальности штрихкода в системе.
//
// Параметры:
//  ШтрихКод - штрихкод, по которому ведется поиск
//	Объект - объект, который использует штрихкод.
Функция СформироватьСообщениеШтрихкодНеУникален(Штрихкод, Объект)
	
	ВидОбъекта = "";
	
	Если ТипЗнч(Объект) = Тип("СправочникСсылка.Номенклатура") Тогда
		ВидОбъекта = "номенклатуры";
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.Карточки") Тогда
		ВидОбъекта = "карточки";
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.ПрочиеАктивы") Тогда
		ВидОбъекта = НСтр("ru = 'прочего актива'");
	ИначеЕсли Метаданные.Документы.Содержит(Объект.Метаданные()) Тогда
		ВидОбъекта = "документа";
	КонецЕсли;	
	
	Возврат "Штрихкод" + " """ + ШтрихКод + """ " + НСтр("ru = 'используется для'") + " " + ВидОбъекта + "  """ + Объект + """.";
	
КонецФункции // СформироватьСообщениеШтрихкодНеУникален()

// Формирует сообщение о назначении штрихкода объекту.
//
// Параметры:
//  ШтрихКод - штрихкод, который устанавливается
//	Объект - объект, который использует штрихкод.
Функция СформироватьСообщениеШтрихкодУстановлен(Штрихкод, Объект) Экспорт
	
	ВидОбъекта = "";
	
	Если ТипЗнч(Объект) = Тип("СправочникСсылка.Номенклатура") Тогда
		ВидОбъекта = "номенклатуры";
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.Карточки") Тогда
		ВидОбъекта = "карточки";
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.ПрочиеАктивы") Тогда
		ВидОбъекта = НСтр("ru = 'прочего актива'");
	ИначеЕсли Метаданные.Документы.Содержит(Объект.Метаданные()) Тогда
		ВидОбъекта = "документа";
	КонецЕсли;	
	
	Возврат НСтр("ru = 'Установлен штрихкод'") + " " + ВидОбъекта + " """ + ШтрихКод + """.";
	
КонецФункции // СформироватьСообщениеШтрихкодУстановлен()

// Функция выполняет поиск существующих объектов по штрихкоду.
//
// Параметры:
//  ШтрихкодПараметр - штрихкод, по которому ведется поиск
//  Объект - текущий объект, в форме которого выполняется обработка оповещения
//  Отказ - признак отказа от дальнейшей обработки объекта
//  ПараметрыДействия - структура дополнительных параметров.
//
// Возвращаемое значение:
//  Истина - если штрихкоды найдены
//  Ложь   - если штрихкоды не удалось найти.
Функция ПроверкаУникальностиШтрихкодов(ШтрихкодПараметр, Объект, Отказ = Ложь, ПараметрыДействия = Неопределено) Экспорт
	
	// инициализация вспомогательных переменных
	РезультатПроверки = Истина;
	Ошибки = "";
	
	// получение входных параметров
	Если ПараметрыДействия = Неопределено Тогда
		ПараметрыДействия = Новый Структура;
	КонецЕсли;
	Если НЕ ПараметрыДействия.Свойство("СообщатьОбОшибке") = Неопределено Тогда
		ПараметрыДействия.Вставить("СообщатьОбОшибке",Ложь);
	КонецЕсли;
	Если НЕ ПараметрыДействия.Свойство("ТекстСообщения") Тогда
		ПараметрыДействия.Вставить("ТекстСообщения","");
	КонецЕсли;
	
	// формирование массива штрихкодов на основе переданных параметров
	МассивШтрихкоды = Новый Массив;
	Если ТипЗнч(ШтрихкодПараметр) = Тип("Массив") Тогда
		МассивШтрихкоды = ШтрихкодПараметр;
	Иначе
		МассивШтрихкоды.Добавить(ШтрихкодПараметр);
	КонецЕсли;
	
	// проверка уникальности штрихкодов внутри массива
	Если МассивШтрихкоды.Количество() > 1  Тогда
		
		// исключение из массива не уникальных штрихкодов
		ВсеШтрихкоды = Новый ТаблицаЗначений;
		ВсеШтрихкоды.Колонки.Добавить("Штрихкод",Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(200)));
		Для Каждого ТекШтрихкод Из МассивШтрихкоды Цикл
			СтрокаШтрихкод = ВсеШтрихкоды.Добавить();
			СтрокаШтрихкод.Штрихкод = ТекШтрихкод;
		КонецЦикла;
		УникальныеШтрихкоды = ВсеШтрихкоды.Скопировать();
		УникальныеШтрихкоды.Свернуть("Штрихкод");
		МассивШтрихкоды = УникальныеШтрихкоды.ВыгрузитьКолонку("Штрихкод");
		
		// получение дублей и формирование сообщений об ошибке
		Если МассивШтрихкоды.Количество() <> ВсеШтрихкоды.Количество() Тогда 
			Отказ = Истина;
			Для Каждого ТекШтрихкод Из МассивШтрихкоды Цикл
				МассивСтрок = ВсеШтрихкоды.НайтиСтроки(Новый Структура("Штрихкод",ТекШтрихкод));
				Если МассивСтрок.Количество() > 1 Тогда
					Ошибки = Ошибки + ?(Ошибки = "", "", Символы.ПС) + "Штрихкод" + " """ + ТекШтрихкод + """ " + НСтр("ru = 'дублируется в таблице.'");
					РезультатПроверки = Ложь;
				КонецЕсли;
			КонецЦикла
		КонецЕсли;
		
	КонецЕсли;
	
	// поиск в базе данных по штрихкодам
	НайденныеОбъекты = НайтиОбъектыПоШтрихкоду(МассивШтрихкоды);
	
	Для Каждого Штрихкод Из МассивШтрихкоды Цикл
		
		Если Штрихкод = "" Тогда
			Продолжить;
		КонецЕсли;
		
		// проверка по найденным в базе данных штрихкодам
		Отбор = Новый Структура();
		Отбор.Вставить("ШтрихКод", ШтрихКод);
		НайденныеСтроки = НайденныеОбъекты.НайтиСтроки(Отбор);
		
		СоответствуетТекущемуОбъекту = Ложь;
		
		Для Каждого ТекНайденнаяСтрока Из НайденныеСтроки Цикл
			
			// если это текущий объект, то все в порядке
			Если НЕ ЗначениеЗаполнено(ТекНайденнаяСтрока.Объект) ИЛИ ТекНайденнаяСтрока.Объект = Объект Тогда
				СоответствуетТекущемуОбъекту = Истина;				
				Продолжить;
			КонецЕсли;
			
			// штрихкод не уникален
			Ошибки = Ошибки + ?(Ошибки = "", "", Символы.ПС) + СформироватьСообщениеШтрихкодНеУникален(ТекНайденнаяСтрока.Префикс, ТекНайденнаяСтрока.Объект);
			РезультатПроверки = Ложь;
			Прервать;
			
		КонецЦикла;
		
		// проверка по регистру запрещенные штрихкоды
		Если НЕ СоответствуетТекущемуОбъекту И ШтрихкодЗапрещен(ШтрихКод) Тогда
			Ошибки = Ошибки + ?(Ошибки = "", "", Символы.ПС) + "Штрихкод"  + " """ + ШтрихКод + """ " 
				+ НСтр("ru = 'запрещен в системе.'");
			РезультатПроверки = Ложь;
			Отказ = Истина;
		КонецЕсли;
			
	КонецЦикла;
	
	// вывод сообщения об обнаруженных ошибках
	ПараметрыДействия.ТекстСообщения = Ошибки;
	Если ПараметрыДействия.СообщатьОбОшибке Тогда
		Если НЕ РезультатПроверки И ПараметрыДействия.ТекстСообщения <> "" Тогда
			ВывестиСообщение(ПараметрыДействия.ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатПроверки;
	
КонецФункции

// Функция проверяет штрихкод на уникальность, запрет и соответствие префикса.
//
// Параметры
//  Штрихкод  - Проверяемый штрихкод.
//
// Возвращаемое значение:
//  Истина - если код прошел все проверки
//  Ложь   - если код не прошел все проверки.
Функция ПроверкаНовогоШтрихкода(Штрихкод, ЭтоТовар = Ложь)
	
	// Исключим пересечение документов, карточек и др.объектов по префиксу с товарами.
	Если НЕ ЭтоТовар Тогда
		
		Префикс = Константы.ПрефиксВесовогоШК.Получить();
		Если Лев(Штрихкод,СтрДлина(Префикс)) = Префикс Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Префикс = Константы.ПрефиксШтучногоШК.Получить();
		Если Лев(Штрихкод,СтрДлина(Префикс)) = Префикс Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	// проверка по регистру "Запрещенные штрихкоды"
	Если ШтрихкодЗапрещен(ШтрихКод)	Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// поиск в базе данных по штрихкодам
	НайденныеОбъекты = НайтиОбъектыПоШтрихкоду(Штрихкод);
	Если НайденныеОбъекты.Количество() > 1 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции // ПроверкаНовогоШтрихкода()

// Выполняет обработку после события считывания штрихкода
//
Процедура ОбработкаОбъектовПоШтрихкоду(ПараметрыДействия, Форма = Неопределено, Объект = Неопределено) Экспорт 
	
	Если НЕ ПараметрыДействия.Свойство("ОбъектыПоШтрихкоду") Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектыПоШтрихкоду = ПараметрыДействия.ОбъектыПоШтрихкоду;
	Вес = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "Вес", 0);
	ПараметрыДействия.Удалить("ОбъектыПоШтрихкоду");
	Если ТипЗнч(ОбъектыПоШтрихкоду) <> Тип("ТаблицаЗначений") 
		И ТипЗнч(ОбъектыПоШтрихкоду) <> Тип("Массив") Тогда
		Возврат;	
	КонецЕсли;
	
	// Определение возможности подстановки штрихкода/найденного объекта в поля формы.
	Если НЕ ПараметрыДействия.Свойство("ДоступныеПоля") Тогда
		ПараметрыДействия.Вставить("ДоступныеПоля", Новый Структура);
	КонецЕсли;
	ДоступныеПоля = ПараметрыДействия.ДоступныеПоля;
	Если Форма <> Неопределено Тогда
		ПолучитьОсновнойОбъектФормы(Форма, Объект); 
		Если Форма.Элементы.Найти("Список") = Неопределено И Объект <> Неопределено Тогда
			// Проверка формы диалога на наличие полей для вставки найденных объектов.
			Если ЕстьРеквизит(Объект,, 	"Товары") 	Тогда ДоступныеПоля.Вставить("ВыборТовара");	КонецЕсли;
			Если ЕстьРеквизит(Объект, "Номенклатура", "Продукция") Тогда
				ДоступныеПоля.Вставить("ВыборТовара");
			КонецЕсли;
			Если ЕстьРеквизит(Объект, "Номенклатура", "Скидки") Тогда
				ДоступныеПоля.Вставить("ВыборТовара");
			КонецЕсли;
			Если ЕстьРеквизит(Объект, 	"Карточка") Тогда ДоступныеПоля.Вставить("ВыборКарты");		КонецЕсли;
			Если ЕстьРеквизит(Объект, 	"Актив") 	Тогда ДоступныеПоля.Вставить("ВыборАктива");	КонецЕсли;
			Если ЕстьРеквизит(Объект,, 	"Активы") 	Тогда ДоступныеПоля.Вставить("ВыборАктива");	КонецЕсли;
		ИначеЕсли ЕстьРеквизит(Форма, "Штрихкод") Тогда 
			ДоступныеПоля.Вставить("ВыборШтрихкода");	
		КонецЕсли;
	КонецЕсли;
	
	ЕстьДоступныеПоля = ДоступныеПоля.Количество();
	
	// получим только те объекты, где штрихкод не запрещен
	НеЗапрещенныеОбъектыПоШтрихкоду = Новый Массив;
	Для Каждого ОбъектПоШтрихкоду Из ОбъектыПоШтрихкоду Цикл
		Если НЕ ОбъектПоШтрихкоду.Запрет Тогда
			ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(ОбъектПоШтрихкоду.Объект));
			СтруктураСтроки = Новый Структура;
			СтруктураСтроки.Вставить("Объект",						ОбъектПоШтрихкоду.Объект);
			СтруктураСтроки.Вставить("ЕдиницаИзмерения",			ОбъектПоШтрихкоду.ЕдиницаИзмерения);
			СтруктураСтроки.Вставить("ХарактеристикаНоменклатуры",	ОбъектПоШтрихкоду.ХарактеристикаНоменклатуры);
			СтруктураСтроки.Вставить("Штрихкод",					ОбъектПоШтрихкоду.Штрихкод);
			СтруктураСтроки.Вставить("Запрет",						ОбъектПоШтрихкоду.Запрет);
			СтруктураСтроки.Вставить("ИмяФормыСписка", 				ОбъектМетаданных.ПолноеИмя()+".ФормаСписка");
			Если Вес>0 Тогда
				СтруктураСтроки.Вставить("Вес", Вес);
			КонецЕсли;
			НеЗапрещенныеОбъектыПоШтрихкоду.Добавить(СтруктураСтроки);
		КонецЕсли;
	КонецЦикла;
	
	// Обработка считывания штрихкода в зависимости от количества найденных объектов в регистре.
	Если ОбъектыПоШтрихкоду.Количество() = 0 Тогда
		
		// Если не найдено ни одного объекта,
		// штрихкод может быть использован в некоторых справочниках для подстановки в поле "Штрихкод".
		Если ДоступныеПоля.Свойство("ВыборШтрихкода") Тогда
			ПараметрыДействия.Вставить("ВыбранноеЗначение", ПараметрыДействия.ШтрихКод);
			ПараметрыДействия.Вставить("НовыйШтрихкод", ПараметрыДействия.ШтрихКод);
		КонецЕсли;
		
	ИначеЕсли НеЗапрещенныеОбъектыПоШтрихкоду.Количество() = 0 Тогда
		
		// если все найденные объекты запрещены
		ОбъектПоШтрихкоду = ОбъектыПоШтрихкоду[0];
		Если Форма = Неопределено Тогда
			ВывестиСообщение(НСтр("ru = 'Штрихкод ""%1"" запрещен в системе'"), ПараметрыДействия.УникальныйИдентификаторФормы,,,, ОбъектПоШтрихкоду.ШтрихКод,);						
		Иначе
			ВывестиСообщение(НСтр("ru = 'Штрихкод ""%1"" запрещен в системе'"), Форма,,,, ОбъектПоШтрихкоду.ШтрихКод,);						
		КонецЕсли;
		
	ИначеЕсли НеЗапрещенныеОбъектыПоШтрихкоду.Количество() = 1 Тогда
		
		// если найден 1 не запрещенный объект
		Обработан = Ложь;
		
		Если ЕстьДоступныеПоля Тогда
			
			ОбъектПоШтрихкоду = НеЗапрещенныеОбъектыПоШтрихкоду[0];
			
			Если ТипЗнч(ОбъектПоШтрихкоду.Объект)=Тип("СправочникСсылка.Номенклатура") И ДоступныеПоля.Свойство("ВыборТовара") 
				ИЛИ ТипЗнч(ОбъектПоШтрихкоду.Объект)=Тип("СправочникСсылка.Карточки") И ДоступныеПоля.Свойство("ВыборКарты") 
				ИЛИ ТипЗнч(ОбъектПоШтрихкоду.Объект)=Тип("СправочникСсылка.ПрочиеАктивы") И ДоступныеПоля.Свойство("ПрочийАктив") Тогда
				Обработан = Истина;
				Если ОбъектПоШтрихкоду.Запрет Тогда
					Если Форма = Неопределено Тогда
						ВывестиСообщение(НСтр("ru = 'Штрихкод ""%1"" запрещен в системе'"), ПараметрыДействия.УникальныйИдентификаторФормы,,,, ОбъектПоШтрихкоду.ШтрихКод,);						
					Иначе
						ВывестиСообщение(НСтр("ru = 'Штрихкод ""%1"" запрещен в системе'"), Форма,,,, ОбъектПоШтрихкоду.ШтрихКод,);						
					КонецЕсли;
				Иначе 
					ПараметрыДействия.Вставить("ВыбранноеЗначение", ОбъектПоШтрихкоду);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		// Если объект невозможно обработать в форме - открытие формы списка с позиционированием на объекте.
		Если НЕ Обработан Тогда
			ПараметрыДействия.Вставить("ОбъектыПоШтрихкодуОбработатьВСписке", НеЗапрещенныеОбъектыПоШтрихкоду);
		КонецЕсли;			
		
	Иначе 
		
		// Если найдено более 1 не запрещенного объекта,
		// выполняется открытие формы выбора объекта из списка.
		ПараметрыДействия.Вставить("ОбъектыПоШтрихкодуОбработатьВФорме", НеЗапрещенныеОбъектыПоШтрихкоду);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьПоискОбъектовПоШтрихкодуУДокумента(Форма, Объект, ПараметрыДействия) Экспорт
	
	// поиск объектов по штрихкоду
	Вес = 0;
	ОбъектыПоШтрихкоду = НайтиОбъектыПоШтрихкоду(ПараметрыДействия.ШтрихКод,,Истина, Вес);
	ПараметрыДействия.Вставить("ОбъектыПоШтрихкоду",ОбъектыПоШтрихкоду);
	Если ЗначениеЗаполнено(Вес) Тогда
		ПараметрыДействия.Вставить("Вес", Вес);
	КонецЕсли;
	ОбработкаОбъектовПоШтрихкоду(ПараметрыДействия, Форма, Объект);
	
КонецПроцедуры
